Revit 2027 API
DirectShapeType.UserAssignability Property
 An option controlling the ability of DirectShapes to assign this DirectShapeType as its type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DirectShapeTypeUserAssignability UserAssignability { get; set; }
Public Property UserAssignability As DirectShapeTypeUserAssignability
	Get
	Set
public:
property DirectShapeTypeUserAssignability UserAssignability {
	DirectShapeTypeUserAssignability get ();
	void set (DirectShapeTypeUserAssignability value);
}
member UserAssignability : DirectShapeTypeUserAssignability with get, set
Property Value
DirectShapeTypeUserAssignability
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
DirectShapeType Class
Autodesk.Revit.DB Namespace